Dolomonti/ESP32s3-Lawnmower/src/main.cpp
/* Lawnmower Project - main.cpp */

#include <Arduino.h>

/*
// ====================================================================================
// ===== KEEP ME IN EVERY VERSION OF THIS CODE HERE ON TOP ============================
// ====================================================================================
//
// This code is intended for the Arduino IDE to program an ESP32 S3 board.
// To ensure successful compilation, please use the following environment setup:
// Partition Scheme ändern: Wähle in der Arduino IDE "Huge APP (3MB No OTA/1MB SPIFFS)". Dies gibt deinem Code mehr als doppelt so viel Platz (3,0 MB statt 1,2 MB).
// -- BOARD MANAGER --
// 1. In Arduino IDE -> Settings -> "Additional boards manager URLs", add:
//    https://raw.githubusercontent.com/espressif/arduino-esp32/gh-pages/package_esp32_dev_index.json
// 2. Go to Tools -> Board -> Boards Manager...
// 3. Search for "esp32" and install "esp32 by Espressif Systems" version 3.3.0.
//
// -- REQUIRED LIBRARIES (from your installed list) --
// Use the Arduino Library Manager (Sketch -> Include Library -> Manage Libraries...) to install:
// 1. ArduinoJson by Benoit Blanchon (Version 7.4.2)
// 2. Async TCP by ESP32Async (Version 3.4.7)
// 3. ESP Async WebServer by ESP32Async (Version 3.8.0)
// 4. MPU6050_tockn by tockn (Version 1.5.2) - This is likely the MPU6050 library being used.
//ESP32 Project Library List:

Here is a complete list of the libraries installed in your Arduino IDE, based on the provided screenshots.

Core Libraries for This Project
ArduinoJson by Benoit Blanchon (Version 7.4.2)

Async TCP by ESP32Async (Version 3.4.7)

ESP Async WebServer by ESP32Async (Version 3.8.0)

MPU6050_tockn by tockn (Version 1.5.2)

Other Installed Libraries
NTPClient by Fabrice Weinberg (Version 3.2.1)

Servo by Michael Margolis, Arduino (Version 1.2.2)

ArduinoSTL by Mike Matera (Version 1.3.3)

BluetoothSerial by Henry Abrahamsen (Version 1.1.0)

DoubleResetDetector_C by Khoi Hoang (Version 1.8.1)

ESP32Servo by Kevin Harrington, John K... (Version 3.0.8)

ESP_AT_Lib by Khoi Hoang (Version 1.5.1)

EthernetWebServer by Khoi Hoang (Version 2.4.1)

EthernetWebServer_STM by Khoi Hoang (Version 1.5.0)

Ethernet_Generic by Various (Version 2.8.1)

FlashStorage_RTL8720 by Khoi Hoang (Version 1.1.0)

FlashStorage_SAMD by Cristian Maglie (Version 1.3.2)

FlashStorage_STM32 by Khoi Hoang (Version 1.2.0)

FlashStorage_STM32F1 by Khoi Hoang (Version 1.1.0)

Functional-Vlpp by Khoi Hoang (Version 1.0.2)

NimBLE-Arduino by h2zero (Version 2.3.4)

PS3 Controller Host by Jeffrey van Pernis (Version 2.0.0)

STM32duino LwIP by Adam Dunkels... (Version 2.1.3)

STM32duino STM32Ethernet by... (Version 1.4.0)

SinricPro_Generic by Boris Jaeger... (Version 2.8.5)

UIPEthernet by Norbert Truchsess, Cassy... (Version 2.0.12)

USB Host Shield Library 2.0 by Oleg... (Version 1.7.0)

WebServer_WT32_ETH0 by Khoi Hoang (Version 1.5.1)

WebSockets_Generic by Markus Sattler, Khoi... (Version 2.16.1)

WiFi101_Generic by Arduino (Version 1.0.0)

WiFiEspAT by Juraj Andrassy (Version 1.5.0)

WiFiMulti_Generic by Khoi Hoang (Version 1.2.2)

WiFiNINA_Generic by Arduino, Khoi Hoang... (Version 1.8.15-1)

WiFiWebServer by Khoi Hoang (Version 1.10.1)
// ====================================================================================
*/

#define ENABLE_DEBUG_SERIAL true // Set to false to disable most Serial output

#define PRINT_FEEDBACK_BLOCK false  // Hoverboard RX print out in Serial Monitor

#define HOVER_SERIAL_BAUD        115200      // Baud rate for HoverSerial (hoverboard communication)
#define SERIAL_BAUD              115200      // Baud rate for built-in Serial (Serial Monitor)
#define START_FRAME              0xABCD      // Start frame for reliable serial communication
#define TIME_SEND                100         // Sending time interval (ms)
#define HEARTBEAT_INTERVAL       5000        // Heartbeat interval (ms)
#define TIMEOUT_THRESHOLD        15000       // Timeout threshold (ms)


#define CENTER_ZONE_THRESHOLD 5.0    // Programmable center threshold for Case 3, hold the line mode
// #define SKILL8_THRESHOLD_ANGLE 45.0 // <<< REMOVED: This is now a configurable setting in the Settings struct

#define MAX_SPEED 1000    // Maximum allowed speed
#define MAX_STEER 1000    // Maximum allowed steering

// These are now part of the Settings struct, but we keep them here as initial defaults
// if the EEPROM is empty.
// int16_t currentMaxSpeed = 200;  // Dynamic maximum speed
// int16_t currentMaxSteer = 200;  // Dynamic maximum steering
// int16_t bladeWorkingSpeed = 0;
// int16_t bladeStage2Speed = 0;
// int16_t bladeMaxSpeed = 9000;


#define HOVER_RX_PIN             18          // GPIO for HoverSerial TX blue cable
#define HOVER_TX_PIN             17          // GPIO for HoverSerial RX green cable
#ifndef LED_BUILTIN
  #define LED_BUILTIN            2           // Onboard LED pin (fallback if not defined by board)
#endif
#define BUTTON1_PIN              10          // GPIO for Button 1
#define BUTTON2_PIN              11          // GPIO for Button 2
#define BLADE_UP_PIN               35          // Example GPIO pin for blade up
#define BLADE_DOWN_PIN           36          // Example GPIO pin for blade down
#define EMERGENCY_STOP_PIN       15            // GPIO pin for the emergency stop button
#define BLADE_BATTERY_PIN            1         // to measure the minus pole of the 4S battery and have multiple resistors inbetween!
#define BLADE_UNIT_PIN               20        // Power Pin für Blade Unit
#define DRIVE_UNIT_PIN               20        // Power Pin für Drive Unit


#include <ESP32Servo.h>
const int BLADE_ESC_PIN = 4; // Wunschgemäß auf Pin 4 gesetzt
const int BLADE_RELAY_PIN = 5;
const int BLADE_ZERO_US = 1500; // je nach ESC Voreinstellung

#define SAFETY_TRIGGER_DELAY 5000    // Verzögerung für Sicherheitsabschaltungen Volt un Temperatur in ms (5 Sek)

// ====================================================================================
// ===== PHASE 3 REFACTORING: Constants & Macros ======================================
// ====================================================================================

// --- Angle Constants ---
constexpr float ANGLE_NORMALIZE_MIN = -180.0f;
constexpr float ANGLE_NORMALIZE_MAX = 180.0f;
constexpr float CAPSIZE_THRESHOLD_PITCH = 60.0f;  // Capsize detection angle
constexpr float CAPSIZE_THRESHOLD_ROLL = 60.0f;

