Dolomonti/ESP32s3-Lawnmower/src/main.cpp
// --- PD-Controller Constants ---
constexpr float PD_ERROR_THRESHOLD = 2.0f;  // Target reached threshold in degrees

// --- Debug Logging Macro (Phase 3.2) ---
// Usage: DEBUG_LOG("Message"); or DEBUG_PRINTF("Value: %d\n", val);
#define DEBUG_LOG(msg) do { if (ENABLE_DEBUG_SERIAL) debugPrintln(msg); } while(0)
#define DEBUG_PRINTF(fmt, ...) do { if (ENABLE_DEBUG_SERIAL) debugPrintf(fmt, ##__VA_ARGS__); } while(0)

// ====================================================================================

// 1. ESP-NOW Command Struktur
typedef struct __attribute__((packed)) {
    uint16_t start;       // Start frame
    int16_t steer;
    int16_t speed;
    uint8_t commandCode;  // Skill command code
    uint16_t checksum;    // Checksum
} ESPNowCommand;

ESPNowCommand receivedCommand;
ESPNowCommand espNowCommand; 
ESPNowCommand sendBuffer;
SemaphoreHandle_t espNowMutex;

// Serial Command Struktur (Hoverboard-Protokoll)
typedef struct __attribute__((packed)) {
  uint16_t start;      // 0xABCD: Start-Kennung
  int16_t cmdCode;     // 1 = Normaler Joystick-Modus, 2 = Distanz-Mission
  int16_t steer;       // Modus 1: Lenkung (-1000 bis 1000) | Modus 2: Distanz Links (in cm)
  int16_t speed;       // Modus 1: Speed (-1000 bis 1000)   | Modus 2: Distanz Rechts (in cm)
  int16_t maxSpeedL;   // maxSpeedL
  int16_t maxSpeedR;   // maxSpeedR 
  int16_t accPct;      // Beschleunigungs-Zone: % der Gesamtstrecke (0-100)
  int16_t brkPct;      // Brems-Zone: % der Gesamtstrecke (0-100)
  uint16_t checksum;   // XOR-Prüfsumme über alle vorherigen Felder
} SerialCommand;

// WICHTIG: Command wird hier EINMAL deklariert
SerialCommand Command;

// Globale Variablen für die Steuerung
uint16_t global_cmdCode = 0;   
uint16_t global_accel = 10;    
uint16_t global_brake = 150;   
int16_t global_maxSpeedL = 0; // FIX: Deklaration hinzugefügt
int16_t global_maxSpeedR = 0; // FIX: Deklaration hinzugefügt

// pinMode(BLADE_UP_PIN, OUTPUT);
// pinMode(BLADE_DOWN_PIN, OUTPUT);

#include <WiFi.h>
#include <DNSServer.h>
#include <esp_now.h>
#include <HardwareSerial.h>
#include <esp_wifi.h>

#include "I2Cdev.h"
#include "MPU6050_6Axis_MotionApps20.h"
#include "Wire.h"

#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <AsyncWebSocket.h>

#include <ArduinoJson.h>

#include <EEPROM.h>
#include <ArduinoOTA.h>
#include "esp_crc.h" // Dies für die CRC32-Berechnung hinzufügen

DNSServer dnsServer;        // <--- DNS Server Instanz
const byte DNS_PORT = 53;

#define ESPNOW_FIXED_CHANNEL 6

#define EEPROM_SIZE 512 // Adjust based on your requirements
#define SSID_ADDR 0      // EEPROM address for SSID
#define PASSWORD_ADDR 32 // EEPROM address for password
#define SETTINGS_ADDR 100 // EEPROM address for settings structure

// --- Settings Structure for EEPROM Persistence ---
struct Settings {
    uint32_t magic; // Magic number to check if settings are initialized

    // Drive System
    int16_t driveMinShutdownVoltage;
    int16_t driveSafetyModeVoltage;
    int16_t driveHighVoltage;
    int16_t driveEmergencyLowTemp;
    int16_t driveSafetyModeTemp;
    int16_t driveHighTemp;

    // Blade System
    int16_t bladeMinShutdownVoltage;
    int16_t bladeSafetyModeVoltage;
    int16_t bladeHighVoltage;
    int16_t bladeEmergencyLowTemp;
    int16_t bladeSafetyModeTemp;
    int16_t bladeHighTemp;

    // Speed & Steering
    int16_t maxSpeed;
    int16_t maxSteer;
    int16_t currentMaxSpeed;
    int16_t currentMaxSteer;

    float bladeBatteryFactor; // Der Multiplikator für blade batterz adjustment (z.B. 23.0)
    float driveBatteryFactor;

    // Blade Speeds
    int16_t bladeWorkingSpeed;
    int16_t bladeStage2Speed;
    int16_t bladeMaxSpeed;
    int16_t bladeCableResetRpm;
    int16_t bladeResetRampS;      
    int16_t bladeResetDurationS;

    float capsizeAngle;     // The angle (in degrees) at which capsize is detected.
    int16_t capsizeTimeout; // The time (in ms) the angle must be exceeded to trigger a stop.
    
    float Kp; // Proportional Gain
    float Kd; // Derivative Gain

    char apiKey[65]; // Google Gemini API Key
};

Settings currentSettings; // Global settings object

// ---  Blade Control Variablen & State Machine ---
Servo bladeEsc; // Das Objekt zur Motorsteuerung

enum BladeState {
  BLADE_OFF,
  BLADE_WORK,         // Normales Mähen
  BLADE_CABLE_RESET   // Die Rampe für den Kabel-Reset
};

BladeState currentBladeState = BLADE_OFF;

// Blade height state for safety: only allow blade ON / speeds when blade is DOWN
enum BladeHeight {
  BLADE_HEIGHT_UNKNOWN,
  BLADE_HEIGHT_UP,
  BLADE_HEIGHT_DOWN
};
BladeHeight currentBladeHeight = BLADE_HEIGHT_UNKNOWN;

unsigned long bladeSequenceStartTime = 0;
int current_blade_pwm = BLADE_ZERO_US; 

// Konstanten für den Reset (festgelegt wie im alten Code, da nicht im EEPROM struct vorhanden)
const unsigned long RESET_RAMP_MS = 3000; // 3 Sekunden Hochfahren
const unsigned long RESET_HOLD_MS = 1000; // 1 Sekunde Halten

// State variables for the new safety logic
bool isInSafetyMode = false;
int16_t originalMaxSpeed = 0; // Stores max speed before entering safety mode
bool isHighVoltageShutdown = false;

// Temperature monitoring thresholds (unchanged)
#define TEMP_SHUTDOWN_DEGREES        8000  // System shuts down above 80.0 C
#define TEMP_CRITICAL_DEGREES        7000  // Critical warning above 70.0 C
#define TEMP_WARNING_DEGREES         6000  // Warning above 60.0 C

// Timer for sending status updates to the webpage
unsigned long lastStatusSend = 0;
const long statusSendInterval = 2000; // Send status every 2 seconds


AsyncWebServer server(80); // Define the web server
AsyncWebSocket ws("/ws");  // Define the WebSocket path
char stored_ssid[32] = ""; // Store WiFi SSID
char stored_password[32] = ""; // Store WiFi password
bool isWiFiConnected = false; // WiFi connection status
bool apShutoffInitiated = false; // AP shutdown status
unsigned long apStartTime = 0; // AP start time
uint8_t selfMacAddress[6]; // Declare the MAC address variable
volatile bool shouldRestart = false; // Flag to trigger restart from main loop


// ====================================================================================
// ===== NEU: Web Serial Puffer Variablen & Funktionen ================================
// ====================================================================================
bool webLogActive = false;       // Schalter: Soll ans Web gesendet werden?
String webLogBuffer = "";        // Der Puffer, der Text sammelt
unsigned long lastWebLogSend = 0;// Timer für das 0.5s Intervall

// 1. Ersatz für debugPrint / debugPrintln
template <typename T>
void debugPrint(T msg) {
    Serial.print(msg); // Immer an USB senden
    if (webLogActive) {
        webLogBuffer += String(msg);
        if (webLogBuffer.length() > 2000) webLogBuffer = "--- BUFFER OVERFLOW ---\n"; 
    }
}

template <typename T>
void debugPrintln(T msg) {
    Serial.println(msg); // Immer an USB senden
    if (webLogActive) {
        webLogBuffer += String(msg) + "\n"; 
         if (webLogBuffer.length() > 2000) webLogBuffer = "--- BUFFER OVERFLOW ---\n";
    }
}

// Overloads for IPAddress to avoid ambiguous conversions to String
void debugPrint(const IPAddress &msg) {
    Serial.print(msg);
    if (webLogActive) {
        webLogBuffer += msg.toString();
        if (webLogBuffer.length() > 2000) webLogBuffer = "--- BUFFER OVERFLOW ---\n";
    }
}

