Dolomonti/ESP32s3-Lawnmower/src/main.cpp
void debugPrintln(const IPAddress &msg) {
    Serial.println(msg);
    if (webLogActive) {
        webLogBuffer += msg.toString() + "\n";
        if (webLogBuffer.length() > 2000) webLogBuffer = "--- BUFFER OVERFLOW ---\n";
    }
}

// *** NEU: Overloads für float um String-Casting-Fehler zu vermeiden ***
void debugPrint(float msg) {
    Serial.print(msg, 2); // 2 Nachkommastellen
    if (webLogActive) {
        webLogBuffer += String(msg, 2);
        if (webLogBuffer.length() > 2000) webLogBuffer = "--- BUFFER OVERFLOW ---\n";
    }
}

void debugPrintln(float msg) {
    Serial.println(msg, 2);
    if (webLogActive) {
        webLogBuffer += String(msg, 2) + "\n";
        if (webLogBuffer.length() > 2000) webLogBuffer = "--- BUFFER OVERFLOW ---\n";
    }
}

// 2. Ersatz für debugPrintf
void debugPrintf(const char *format, ...) {
    char loc_buf[128]; 
    va_list args;
    va_start(args, format);
    vsnprintf(loc_buf, sizeof(loc_buf), format, args);
    va_end(args);

    Serial.print(loc_buf); // Immer an USB
    if (webLogActive) {
        webLogBuffer += String(loc_buf);
        if (webLogBuffer.length() > 2000) webLogBuffer = "--- BUFFER OVERFLOW ---\n";
    }
}
// ====================================================================================

// ########################## DEFAULT SKILL ACTIVATION at start up ##########################

/*
    Configure the default active state of each skill here.
    Set to 'true' to have the skill active by default, or 'false' otherwise.
    Modify these values to change which skills are active on startup.
*/

const bool DEFAULT_SKILL1_ACTIVE = false;
const bool DEFAULT_SKILL2_ACTIVE = false;
const bool DEFAULT_SKILL3_ACTIVE = false;
const bool DEFAULT_SKILL4_ACTIVE = false;
const bool DEFAULT_SKILL5_ACTIVE = false;
const bool DEFAULT_SKILL6_ACTIVE = false;
const bool DEFAULT_SKILL7_ACTIVE = false;
const bool DEFAULT_SKILL8_ACTIVE = true; // Skill 8 active by default, Capsizing     ALL OFF
const bool DEFAULT_SKILL9_ACTIVE = false;

// ########################## END DEFAULT SKILL ACTIVATION ##########################


HardwareSerial HoverSerial(1);        // Use UART1 for hoverboard communication

// Global variables
uint8_t idx = 0;
uint16_t bufStartFrame;
byte *p;  // Pointer for serial data parsing in Receive()
byte incomingByte;
byte incomingBytePrev;

bool button1State = false;
bool button2State = false;



unsigned long lastHeartbeat = 0;

///////////////////////MAC ADRESS INSERT HERE//////////////////////////

struct Device {
    uint8_t mac[6]; // MAC address of the device
    int id;         // ID associated with the device
};

Device deviceList[] = {
    {{0x48, 0x27, 0xE2, 0xE9, 0x11, 0x9C}, 1},
    {{0xFC, 0xB4, 0x67, 0x73, 0xF1, 0x10}, 2},
    {{0xDC, 0xDA, 0x0C, 0x52, 0xDE, 0x84}, 3},
    {{0x30, 0xC6, 0xF7, 0x25, 0xFD, 0xF8}, 4},
    //add new Mac Address devices here
};

int deviceID = -1;  // Variable to store the assigned device ID

const int numberOfPeers = sizeof(deviceList) / sizeof(deviceList[0]); // Define the number of peers

// NEW: Struct to hold all peer-related information
struct PeerInfo {
    bool isConnected;
    unsigned long lastSeen;
    int reconnectAttempts;
    unsigned long lastReconnectAttempt;
};
PeerInfo peers[numberOfPeers]; // Array to track each peer's state


///////////////////////////////////////////////////////////////////


// Function prototypes
void saveSettings();
void loadSettings();
void monitorDirectionChange(float yaw);
void holdTheLine(float yaw);
void holdPositionMovement(float yaw);
void resetHorizon();
void resetAll();
void core1WiFiTask(void * parameter);
void Send(int16_t uSteer, int16_t uSpeed);
void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len);
void resetDevice(AsyncWebServerRequest *request);
void handleResetWifi(AsyncWebServerRequest *request);
extern const char webpage[] PROGMEM; // Correct declaration for an array in program memory
void handleSystemStatus(int16_t battery, int16_t temp);
void handleWebpage(AsyncWebServerRequest *request);
void connectToWiFi(const char* ssid, const char* password);
void logToWebpage(const String& message);
void espNowTask(void *pvParameters);
void mpuReadTask(void *parameter);
void statusTask(void *pvParameters);
void controlLogicTask(void *pvParameters); // Neue Zeile hinzugefügt

//Gyro Initialization

MPU6050 mpu;

bool dmpReady = false;  // Set true if DMP is initialized successfully
uint8_t devStatus;      // Return status after each device operation (0 = success, !0 = error)
uint16_t packetSize;    // Expected DMP packet size (default is 42 bytes)
uint16_t fifoCount;     // Count of all bytes currently in FIFO
uint8_t fifoBuffer[64]; // FIFO storage buffer
SemaphoreHandle_t mpuSemaphore = NULL; // Semaphore to signal MPU data is ready
float lastError = 0.0f;
unsigned long lastPdTime = 0;

Quaternion q;           // [w, x, y, z] quaternion container
VectorFloat gravity;    // [x, y, z] gravity vector
float ypr[3];           // [yaw, pitch, roll] container and gravity vector

// Global yaw, pitch, and roll offsets
float yawOffset = 0.0;
float pitchOffset = 0.0;
float rollOffset = 0.0;

// Global variables for yaw, pitch, roll
float yaw = 0.0, pitch = 0.0, roll = 0.0;

// Case-related variables

bool skill8Active = false;        // State of Skill 8
bool skill8SafetyActive = false;      // Safety signal active state (sending stop commands)
bool hoverboardInverted = false;      // To detect capsizing

int currentCase = 0;          // Case trigger variable (1, 2, 3, 4, or 5)
bool monitorDirection = false;      // Flag for Cases 2 and 4
bool holdLine = false;              // Flag for Case 3
bool holdPosition = false;          // Flag for Case 5 (triggered via Remote)
float targetAngle = 0;              // Target angle for Cases 2 and 4
int turnDirection = 0;              // direction achange awareness
float startYaw = 0;                 // Initial yaw for Cases 3 and 5
float cumulativeYaw = 0;            // Cumulative yaw for Case 5
unsigned long case3StartTime = 0;   // Timer for Case 3 delay
unsigned long lastSerialUpdate = 0;       // Timer for serial updates


unsigned long capsizeDetectTime = 0; // 


 

