Dolomonti/ESP32s3-Lawnmower/src/main.cpp
    // 2. Befehl verarbeiten, wenn vollständig
    if (stringComplete) {
        inputString.trim(); // Leerzeichen entfernen

        // --- A: RESET BEFEHL ---
        if (inputString.equalsIgnoreCase("reset")) {
            DEBUG_LOG("Serial Reset Command Received. Restarting ESP32...");
            ESP.restart();
        }
        
        // --- B: KOMMA-BEFEHLE (Parameter) ---
        else if (inputString.indexOf(',') != -1) {
            int commaIndex1 = inputString.indexOf(',');
            String commandStr = inputString.substring(0, commaIndex1);
            String remainingStr = inputString.substring(commaIndex1 + 1);

            commandStr.trim();
            remainingStr.trim();

            // Skill 7: Limits setzen (Format: "7, speed, steer")
            if (commandStr == "7") { 
                int commaIndex2 = remainingStr.indexOf(',');
                if (commaIndex2 != -1) {
                    String speedStr = remainingStr.substring(0, commaIndex2);
                    String steerStr = remainingStr.substring(commaIndex2 + 1);
                    speedStr.trim();
                    steerStr.trim();
                    
                    if (isValidInteger(speedStr) && isValidInteger(steerStr)) {
                        triggerSkill(7, 0, steerStr.toInt(), speedStr.toInt());
                    } else {
                        debugPrintln("Error: Skill 7 parameters must be integers.");
                    }
                }
            } 
            // Skill 16: Blade Faktor setzen (Format: "16, 1940")
            else if (commandStr == "16") {
                if (isValidInteger(remainingStr)) {
                    int16_t factorValue = remainingStr.toInt();
                    triggerSkill(16, factorValue); 
                } else {
                    debugPrintln("Error: Skill 16 value must be an integer.");
                }
            }
            // Skill 20: Präzisionsfahrt (Format: "20, L_cm, R_cm")
            else if (commandStr == "20") {
                int commaIndex2 = remainingStr.indexOf(',');
                if (commaIndex2 != -1) {
                    String leftStr = remainingStr.substring(0, commaIndex2);
                    String rightStr = remainingStr.substring(commaIndex2 + 1);
                    leftStr.trim();
                    rightStr.trim();
                    if (isValidInteger(leftStr) && isValidInteger(rightStr)) {
                        triggerSkill(20, leftStr.toInt(), rightStr.toInt());
                    } else {
                        debugPrintln("Error: Skill 20 parameters must be integers.");
                    }
                }
            }
            // Skill 19: Neue Parameter setzen (Format: "19, cmd, accel, brake")
            else if (commandStr == "19") {
                // Wir erwarten 2 weitere Kommas im restlichen String
                int commaIndex2 = remainingStr.indexOf(',');
                if (commaIndex2 != -1) {
                    String sCmd = remainingStr.substring(0, commaIndex2);
                    String rest = remainingStr.substring(commaIndex2 + 1);
                    
                    int commaIndex3 = rest.indexOf(',');
                    if (commaIndex3 != -1) {
                        String sAccel = rest.substring(0, commaIndex3);
                        String sBrake = rest.substring(commaIndex3 + 1);
                        
                        sCmd.trim(); sAccel.trim(); sBrake.trim();
                        
                        if (isValidInteger(sCmd) && isValidInteger(sAccel) && isValidInteger(sBrake)) {
                            triggerSkill(19, sCmd.toInt(), sAccel.toInt(), sBrake.toInt());
                        } else {
                            debugPrintln("Error: Skill 19 params must be integers (19, cmd, acc, brk).");
                        }
                    }
                }
            }
            // Normaler Fahrbefehl (Format: "steer, speed")
            else { 
                if (isValidInteger(commandStr) && isValidInteger(remainingStr)) {
                    int16_t steer = commandStr.toInt();
                    int16_t speed = remainingStr.toInt();
                    
                    // Sicherheits-Check gegen Überlauf beim manuellen Fahren
                    if (steer < -currentSettings.maxSteer || steer > currentSettings.maxSteer) {
                        debugPrintf("Error: Steer value out of range (-%d to %d).\n", currentSettings.maxSteer, currentSettings.maxSteer);
                    } else if (speed < -currentSettings.currentMaxSpeed || speed > currentSettings.currentMaxSpeed) {
                        debugPrintf("Error: Speed value out of range (-%d to %d).\n", currentSettings.currentMaxSpeed, currentSettings.currentMaxSpeed);
                    } else {
                        DEBUG_PRINTF("Sending Command - Steer: %d, Speed: %d\n", steer, speed);
                        Send(steer, speed);
                    }
                } else {
                    debugPrintln("Error: Steer and speed must be valid integers.");
                }
            }
        }

        // --- C: EINZEL-BEFEHLE (Skills ohne Komma) ---
        else if (inputString == "1")  { triggerSkill(1); }
        else if (inputString == "2-") { triggerSkill(2, -1000); }
        else if (inputString == "2+") { triggerSkill(2, 1000); }
        else if (inputString == "3")  { triggerSkill(3); }
        else if (inputString == "4-") { triggerSkill(4, -1000); }
        else if (inputString == "4+") { triggerSkill(4, 1000); }
        else if (inputString == "6")  { triggerSkill(6, 1); }
        else if (inputString == "7")  {
            DEBUG_PRINTF("Skill 7 Info: Current Max Speed: %d, Max Steer: %d\n", currentSettings.currentMaxSpeed, currentSettings.currentMaxSteer);
        }
        else if (inputString == "8")  { triggerSkill(8, 1); }
        else if (inputString == "9")  {
            DEBUG_LOG("Skill 9 triggered via Serial. Restarting ESP32...");
            ESP.restart();
        }

        // --- D: FEHLERHAFTE EINGABE ---
        else {
            if (inputString.length() > 0) {
                debugPrintln("Error: Invalid command format.");
                debugPrintln("Use 'reset', '1'-'9', '16, value', or 'steer,speed'.");
            }
        }

        // String zurücksetzen für nächsten Durchlauf
        inputString = "";
        stringComplete = false;
    }
}



// ====================================================================================
// ===== CHANGE START: Updated function to use configurable settings ================
// ====================================================================================
void monitorSkill8Angles(float pitch, float roll) {
    // Check if the angle has exceeded the configured threshold
    if (!skill8SafetyActive && (abs(pitch) > currentSettings.capsizeAngle || abs(roll) > currentSettings.capsizeAngle)) {
        // This is a potential capsize event
        unsigned long now = millis();

        if (capsizeDetectTime == 0) {
            // This is the FIRST moment we detected the tilt. Start the timer.
            capsizeDetectTime = now;
        } else if (now - capsizeDetectTime > currentSettings.capsizeTimeout) {
            // The tilt has been continuous for longer than our configured timeout. This is a REAL event.
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Skill 8: Capsize safety stop triggered (Angle > %.1f for > %dms).\n", currentSettings.capsizeAngle, currentSettings.capsizeTimeout);
            }
            skill8SafetyActive = true;  // Activate the safety stop
            triggerSkill(6, -1);      // Turn off blade
            Send(0, 0);               // Stop hoverboard movement
        }
        // If the tilt is less than the timeout, we do nothing and wait for the next check.

    } else {
        // Angle is normal. Reset the timer.
        capsizeDetectTime = 0;
    }
}
// ====================================================================================
// ===== CHANGE END: End of updated capsize monitoring function =====================
// ====================================================================================


void IRAM_ATTR dmpDataReady() {
  // We MUST use the "FromISR" version inside an interrupt
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  
  // Give the semaphore to wake up the mpuReadTask
  xSemaphoreGiveFromISR(mpuSemaphore, &xHigherPriorityTaskWoken);

