Dolomonti/ESP32s3-Lawnmower/src/main.cpp
    if (abs(rectangleError) < PD_ERROR_THRESHOLD) {
        DEBUG_LOG("Target angle reached.");
        resetAll();
    }
}

// ÄNDERN Sie die Funktion "holdTheLine"
void holdTheLine(float yaw) {
    // Fehler ist die Abweichung vom Startwinkel (Phase 3.1: Using helper)
    float rectangleError = normalizeAngle(startYaw - yaw);

    // PD-Controller (Phase 3.1: Extracted to helper function)
    skillSteer = calculatePDSteer(rectangleError, currentSettings.Kp, currentSettings.Kd, currentSettings.currentMaxSteer);

    if (ENABLE_DEBUG_SERIAL && (millis() - lastSerialUpdate >= 500)) {
        lastSerialUpdate = millis();
        DEBUG_PRINTF("HoldLine | Yaw: %.1f, Dev: %.1f, Steer: %d\n", yaw, -rectangleError, skillSteer);
    }
}



void holdPositionMovement(float yaw) {
    static float previousYaw = yaw;

    // Phase 3.1: Using normalizeAngle helper
    float yawChange = normalizeAngle(yaw - previousYaw);

    cumulativeYaw += abs(yawChange);
    previousYaw = yaw;

    float rectangleError = normalizeAngle(yaw - startYaw);

    // if (ENABLE_DEBUG_SERIAL) {
    //   debugPrint("Deviation: ");
    //   debugPrintln(rectangleError);
    // }

    if (abs(ypr[0]) < 0.5) {
        DEBUG_LOG("Standstill detected!");
        holdPosition = false;
    }
}

void statusTask(void *pvParameters) {
    // Statische Variable für die Glättung
    static float smoothed_blade_mv = 0;

    for (;;) {
        // =========================================================
        // 1. SCHNELLE MESSUNG (Alle 50ms)
        // =========================================================
        
        // 1a. Spannung lesen (Millivolt am Pin 1)
        uint32_t raw_pin_mv = analogReadMilliVolts(BLADE_BATTERY_PIN);

        // 1b. Mit Faktor verrechnen
        float calculated_mv = (float)raw_pin_mv * currentSettings.bladeBatteryFactor;

        // 1c. INTELLIGENTE GLÄTTUNG (Optimiert für Stabilität)
        
        // FALL A: START-UP (Schnell)
        // Wenn der gespeicherte Wert noch unter 5V ist (System startet gerade),
        // übernehmen wir den neuen Wert sofort. Keine Wartezeit beim Einschalten!
        if (smoothed_blade_mv < 5000) {
             smoothed_blade_mv = calculated_mv;
        } 
        // FALL B: BETRIEB (Stabil & Träge)
        // Hier nutzen wir den Filter. 95% Alter Wert, 5% Neuer Wert.
        // Das bügelt Schwankungen durch Motorenstarts komplett glatt.
        else {
             smoothed_blade_mv = (smoothed_blade_mv * 0.95) + (calculated_mv * 0.05);
        }

        // 1d. Global speichern
        global_blade_voltage_mv = (int32_t)smoothed_blade_mv;

        /*
        // --- DEBUG AUSGABE (Alle 2 Sekunden im Monitor sichtbar) ---
        static unsigned long lastDebugPrint = 0;
        if (millis() - lastDebugPrint > 2000 && ENABLE_DEBUG_SERIAL) {
             lastDebugPrint = millis();
             debugPrintf("[StatusTask] Pin1 Raw: %d mV | Factor: %.2f | Calc Bat: %d mV\n", 
                           raw_pin_mv, currentSettings.bladeBatteryFactor, global_blade_voltage_mv);
        }
        */
        // -----------------------------------------------------------

        // Warte das Sende-Intervall ab
        vTaskDelay(statusSendInterval / portTICK_PERIOD_MS);  
        
        if (ws.count() > 0) {
            DynamicJsonDocument doc(512);
            doc["type"] = "status";
            doc["estop"] = skill8SafetyActive; // Sendet true oder false an die Webseite
            
            // --- DRIVE BATTERY (Hoverboard) ---
            if (corrected_batVoltage < 500) { 
                doc["battery"] = nullptr; 
            } else { 
                doc["battery"] = corrected_batVoltage; 
            }
            
            // --- DRIVE TEMP (Hoverboard) ---
            // Feedback ist z.B. 300 (30.0°C). Webseite teilt durch 100.
            // Wir senden mal 10 -> 3000 / 100 = 30.00
            if (Feedback.boardTemp == 0) { 
                doc["temp"] = nullptr; 
            } else { 
                doc["temp"] = Feedback.boardTemp * 10; 
            }
            
            // --- BLADE BATTERY (Zusatzakku) ---
            // Wir haben den Schwellwert auf 1000mV (1V) gesenkt, damit du was siehst.
            if (global_blade_voltage_mv < 1000) {
                doc["blade_battery"] = nullptr;
            } else {
                // Wir senden Centivolt an die Webseite
                // Bsp: 16348 mV / 10 = 1634. Webseite rechnet 1634 / 100 = 16.34 V
                doc["blade_battery"] = global_blade_voltage_mv / 10;
            }
            
            // Dummys für Sensoren, die wir (noch) nicht haben
            doc["battery_temp"] = 0;
            doc["blade_temp"] = 0; // Das erzeugt das "NN" oder "--" für Blade Temp

            // Sende Blade-Status (hilfreich für die Web-UI)
            doc["blade_state"] = (currentBladeState == BLADE_OFF) ? "off" : "work";
            String bladeHeightStr = "unknown";
            if (currentBladeHeight == BLADE_HEIGHT_DOWN) bladeHeightStr = "down";
            else if (currentBladeHeight == BLADE_HEIGHT_UP) bladeHeightStr = "up";
            doc["blade_height"] = bladeHeightStr;

            // --- SPEED CALCULATION (Moved to StatusTask to protect Serial Communication) ---
            // Calculate speed in km/h based on average RPM of both wheels
            
            // FIX: Right wheel is mounted mirrored, so its feedback is inverted (negative for forward)
            // We invert it here to get positive values for forward driving.
            int16_t speedR_corrected = -Feedback.speedR_meas;

            float avg_rpm = (Feedback.speedL_meas + speedR_corrected) / 2.0f;
            
            // Formula: kmh = (avg_rpm * 0.95m * 60) / 1000
            current_speed_kmh = (avg_rpm * 0.95f * 60.0f) / 1000.0f;
            
            // Calculate individual speeds
            float speedL_kmh = (Feedback.speedL_meas * 0.95f * 60.0f) / 1000.0f;
            float speedR_kmh = (speedR_corrected * 0.95f * 60.0f) / 1000.0f;

